app/controllers/registrations_controller.rb

  def create
    user = User.create!(
      pseudo: params['user']['pseudo'],
      password: params['user']['password']
    )
---
INSERT INTO "users" ("pseudo", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"