app/controllers/sessions_controller.rb

  def create
    user = User.find_by(pseudo: params['user']['pseudo']).try(:authenticate, params['user']['password'])
---
SELECT  "users".* FROM "users" WHERE "users"."pseudo" = ? LIMIT ?  [["pseudo", "Tchowski"], ["LIMIT", 1]]