app/controllers/concerns/current_user_concern.rb

  def set_current_user
    print "#{session}"
    if session[:user_id]
        @current_user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]